--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

create database Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

use Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE TABLE Users (
    UserID INT PRIMARY KEY IDENTITY,
    Username NVARCHAR(50) NOT NULL unique,
    Password NVARCHAR(50) NOT NULL unique,
    Role NVARCHAR(20) NOT NULL
);
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
INSERT INTO Users (Username, Password, Role)
VALUES 
('admin', '1234', 'مدير'),
('employee1', '5678', 'موظف');

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE CheckUserLogin
    @Username NVARCHAR(50),
    @Password NVARCHAR(50)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT Role
    FROM Users
    WHERE Username = @Username AND Password = @Password;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE AddUser
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    INSERT INTO Users (Username, Password, Role)
    VALUES (@Username, @Password, @Role);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DeleteUser
    @UserID INT
AS
BEGIN
    DELETE FROM Users
    WHERE UserID = @UserID;

END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmploye
AS
BEGIN
    select* from Users
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE UpdateUser
    @UserID INT,
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    UPDATE Users
    SET Username = @Username,
        Password = @Password,
        Role = @Role
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE SearchUserByID
    @UserID INT
AS
BEGIN
    SET NOCOUNT ON;

    SELECT UserID, Username,Password, Role
    FROM Users
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Customers (
    Balance DECIMAL(18,2) NOT NULL DEFAULT 0,
    AccountNumber BIGINT identity(189564582,2),       -- رقم الحساب
    PhoneNumber NVARCHAR(20) unique not null,   -- رقم الهاتف
    FullName NVARCHAR(100),
    NationalID NVARCHAR(20),
    BirthDate DATE,
    Nationality NVARCHAR(50),
    Gender NVARCHAR(10),
    Age INT,
    Address NVARCHAR(200),

    CONSTRAINT PK_Customers PRIMARY KEY (AccountNumber, PhoneNumber) -- مفتاح أساسي مركب

);
--===========================================================================================================================
--===========================================================================================================================

-- حذف المفتاح الأساسي القديم
ALTER TABLE Customers
DROP CONSTRAINT PK_Customers;
--===========================================================================================================================
--===========================================================================================================================

-- تعيين رقم الهاتف كمفتاح أساسي
ALTER TABLE Customers
ADD CONSTRAINT PK_Customers PRIMARY KEY (PhoneNumber);

ALTER TABLE Customers
ADD AccountType NVARCHAR(20) NOT NULL DEFAULT 'جاري';



--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE AddCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    INSERT INTO Customers ( PhoneNumber, FullName, NationalID, BirthDate, Nationality, Gender, Age, Address, Balance, AccountType)
    VALUES ( @PhoneNumber, @FullName, @NationalID, @BirthDate, @Nationality, @Gender, @Age, @Address, @Balance, @AccountType);
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE UpdateCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    UPDATE Customers
    SET FullName = @FullName,
        NationalID = @NationalID,
        BirthDate = @BirthDate,
        Nationality = @Nationality,
        Gender = @Gender,
        Age = @Age,
        Address = @Address,
        Balance = @Balance,
        AccountType = @AccountType
    WHERE  PhoneNumber = @PhoneNumber;
END



--===========================================================================================================================
--===========================================================================================================================



CREATE PROCEDURE DeleteCustomer
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    DELETE FROM Customers
    WHERE  PhoneNumber = @PhoneNumber;
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SelectCustomer
AS
BEGIN
    select* from Customers
END



--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SearchCustomer
    @AccountNumber BIGINT = NULL,
    @PhoneNumber NVARCHAR(20) = NULL
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountNumber,
           PhoneNumber,
           FullName,
           NationalID,
           BirthDate,
           Nationality,
           Gender,
           Age,
           Address,
           AccountType
    FROM Customers
    WHERE (@AccountNumber IS NULL OR AccountNumber = @AccountNumber)
      AND (@PhoneNumber IS NULL OR PhoneNumber = @PhoneNumber);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Transactions (
    TransactionID INT PRIMARY KEY IDENTITY(1,1),
    AccountNumber BIGINT NOT NULL,
    PhoneNumber NVARCHAR(20) NOT NULL,
    TransactionType NVARCHAR(20) NOT NULL, -- Deposit, Withdraw, Transfer
    Amount DECIMAL(18,2) NOT NULL,
    TransactionDate DATETIME DEFAULT GETDATE(),
    ReceiverAccount BIGINT NULL,
    ReceiverPhone NVARCHAR(20) NULL,
    Notes NVARCHAR(200) NULL,

    -- ربط مع جدول العملاء
    CONSTRAINT FK_Transactions_Customers FOREIGN KEY (PhoneNumber)
        REFERENCES Customers(PhoneNumber)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);




--===================================================================================================================================
--===========================================================================================================================
---================================================================================================================================

CREATE PROCEDURE selecttransaction
as
begin
    select* from Transactions
end




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--================================================================================================================================
CREATE PROCEDURE TransferAmount
    @SenderPhone NVARCHAR(20),
    @ReceiverPhone NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @SenderPhone AND Balance >= @Amount)
        BEGIN
            -- خصم من المرسل
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @SenderPhone;

            -- إضافة للمستلم
            UPDATE Customers
            SET Balance = Balance + @Amount
            WHERE PhoneNumber = @ReceiverPhone;

            -- تسجيل الحركة
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount, ReceiverAccount, ReceiverPhone)
            SELECT s.AccountNumber, s.PhoneNumber, 'Transfer', @Amount, r.AccountNumber, r.PhoneNumber
            FROM Customers s
            JOIN Customers r ON r.PhoneNumber = @ReceiverPhone
            WHERE s.PhoneNumber = @SenderPhone;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للتحويل', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DepositAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;
    BEGIN TRY
        BEGIN TRANSACTION;

        IF NOT EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber)
        BEGIN
            RAISERROR('العميل غير موجود', 16, 1);
            ROLLBACK TRANSACTION;
            RETURN;
        END

        UPDATE Customers
        SET Balance = Balance + @Amount
        WHERE PhoneNumber = @PhoneNumber;

        INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
        SELECT AccountNumber, PhoneNumber, 'Deposit', @Amount
        FROM Customers
        WHERE PhoneNumber = @PhoneNumber;

        COMMIT TRANSACTION;
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END


--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE WithdrawAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber AND Balance >= @Amount)
        BEGIN
            -- خصم المبلغ من الرصيد
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @PhoneNumber;

            -- تسجيل الحركة في جدول Transactions
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
            SELECT AccountNumber, PhoneNumber, 'Withdraw', @Amount
            FROM Customers
            WHERE PhoneNumber = @PhoneNumber;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للسحب', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE GetAccountInfo
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountType, Balance
    FROM Customers
    WHERE PhoneNumber = @PhoneNumber;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectCustomers
AS
BEGIN
    SELECT * FROM Customers;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmployees
AS
BEGIN
    SELECT * FROM Users;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectTransactions
AS
BEGIN
    SELECT * FROM Transactions;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

create database Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

use Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE TABLE Users (
    UserID INT PRIMARY KEY IDENTITY,
    Username NVARCHAR(50) NOT NULL unique,
    Password NVARCHAR(50) NOT NULL unique,
    Role NVARCHAR(20) NOT NULL
);
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
INSERT INTO Users (Username, Password, Role)
VALUES 
('admin', '1234', 'مدير'),
('employee1', '5678', 'موظف');

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE CheckUserLogin
    @Username NVARCHAR(50),
    @Password NVARCHAR(50)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT Role
    FROM Users
    WHERE Username = @Username AND Password = @Password;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE AddUser
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    INSERT INTO Users (Username, Password, Role)
    VALUES (@Username, @Password, @Role);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DeleteUser
    @UserID INT
AS
BEGIN
    DELETE FROM Users
    WHERE UserID = @UserID;

END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmploye
AS
BEGIN
    select* from Users
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE UpdateUser
    @UserID INT,
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    UPDATE Users
    SET Username = @Username,
        Password = @Password,
        Role = @Role
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE SearchUserByID
    @UserID INT
AS
BEGIN
    SET NOCOUNT ON;

    SELECT UserID, Username,Password, Role
    FROM Users
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Customers (
    Balance DECIMAL(18,2) NOT NULL DEFAULT 0,
    AccountNumber BIGINT identity(189564582,2),       -- رقم الحساب
    PhoneNumber NVARCHAR(20) unique not null,   -- رقم الهاتف
    FullName NVARCHAR(100),
    NationalID NVARCHAR(20),
    BirthDate DATE,
    Nationality NVARCHAR(50),
    Gender NVARCHAR(10),
    Age INT,
    Address NVARCHAR(200),

    CONSTRAINT PK_Customers PRIMARY KEY (AccountNumber, PhoneNumber) -- مفتاح أساسي مركب

);
--===========================================================================================================================
--===========================================================================================================================

-- حذف المفتاح الأساسي القديم
ALTER TABLE Customers
DROP CONSTRAINT PK_Customers;
--===========================================================================================================================
--===========================================================================================================================

-- تعيين رقم الهاتف كمفتاح أساسي
ALTER TABLE Customers
ADD CONSTRAINT PK_Customers PRIMARY KEY (PhoneNumber);

ALTER TABLE Customers
ADD AccountType NVARCHAR(20) NOT NULL DEFAULT 'جاري';



--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE AddCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    INSERT INTO Customers ( PhoneNumber, FullName, NationalID, BirthDate, Nationality, Gender, Age, Address, Balance, AccountType)
    VALUES ( @PhoneNumber, @FullName, @NationalID, @BirthDate, @Nationality, @Gender, @Age, @Address, @Balance, @AccountType);
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE UpdateCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    UPDATE Customers
    SET FullName = @FullName,
        NationalID = @NationalID,
        BirthDate = @BirthDate,
        Nationality = @Nationality,
        Gender = @Gender,
        Age = @Age,
        Address = @Address,
        Balance = @Balance,
        AccountType = @AccountType
    WHERE  PhoneNumber = @PhoneNumber;
END



--===========================================================================================================================
--===========================================================================================================================



CREATE PROCEDURE DeleteCustomer
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    DELETE FROM Customers
    WHERE  PhoneNumber = @PhoneNumber;
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SelectCustomer
AS
BEGIN
    select* from Customers
END



--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SearchCustomer
    @AccountNumber BIGINT = NULL,
    @PhoneNumber NVARCHAR(20) = NULL
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountNumber,
           PhoneNumber,
           FullName,
           NationalID,
           BirthDate,
           Nationality,
           Gender,
           Age,
           Address,
           AccountType
    FROM Customers
    WHERE (@AccountNumber IS NULL OR AccountNumber = @AccountNumber)
      AND (@PhoneNumber IS NULL OR PhoneNumber = @PhoneNumber);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Transactions (
    TransactionID INT PRIMARY KEY IDENTITY(1,1),
    AccountNumber BIGINT NOT NULL,
    PhoneNumber NVARCHAR(20) NOT NULL,
    TransactionType NVARCHAR(20) NOT NULL, -- Deposit, Withdraw, Transfer
    Amount DECIMAL(18,2) NOT NULL,
    TransactionDate DATETIME DEFAULT GETDATE(),
    ReceiverAccount BIGINT NULL,
    ReceiverPhone NVARCHAR(20) NULL,
    Notes NVARCHAR(200) NULL,

    -- ربط مع جدول العملاء
    CONSTRAINT FK_Transactions_Customers FOREIGN KEY (PhoneNumber)
        REFERENCES Customers(PhoneNumber)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);




--===================================================================================================================================
--===========================================================================================================================
---================================================================================================================================

CREATE PROCEDURE selecttransaction
as
begin
    select* from Transactions
end




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--================================================================================================================================
CREATE PROCEDURE TransferAmount
    @SenderPhone NVARCHAR(20),
    @ReceiverPhone NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @SenderPhone AND Balance >= @Amount)
        BEGIN
            -- خصم من المرسل
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @SenderPhone;

            -- إضافة للمستلم
            UPDATE Customers
            SET Balance = Balance + @Amount
            WHERE PhoneNumber = @ReceiverPhone;

            -- تسجيل الحركة
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount, ReceiverAccount, ReceiverPhone)
            SELECT s.AccountNumber, s.PhoneNumber, 'Transfer', @Amount, r.AccountNumber, r.PhoneNumber
            FROM Customers s
            JOIN Customers r ON r.PhoneNumber = @ReceiverPhone
            WHERE s.PhoneNumber = @SenderPhone;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للتحويل', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DepositAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;
    BEGIN TRY
        BEGIN TRANSACTION;

        IF NOT EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber)
        BEGIN
            RAISERROR('العميل غير موجود', 16, 1);
            ROLLBACK TRANSACTION;
            RETURN;
        END

        UPDATE Customers
        SET Balance = Balance + @Amount
        WHERE PhoneNumber = @PhoneNumber;

        INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
        SELECT AccountNumber, PhoneNumber, 'Deposit', @Amount
        FROM Customers
        WHERE PhoneNumber = @PhoneNumber;

        COMMIT TRANSACTION;
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END


--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE WithdrawAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber AND Balance >= @Amount)
        BEGIN
            -- خصم المبلغ من الرصيد
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @PhoneNumber;

            -- تسجيل الحركة في جدول Transactions
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
            SELECT AccountNumber, PhoneNumber, 'Withdraw', @Amount
            FROM Customers
            WHERE PhoneNumber = @PhoneNumber;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للسحب', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE GetAccountInfo
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountType, Balance
    FROM Customers
    WHERE PhoneNumber = @PhoneNumber;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectCustomers
AS
BEGIN
    SELECT * FROM Customers;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmployees
AS
BEGIN
    SELECT * FROM Users;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectTransactions
AS
BEGIN
    SELECT * FROM Transactions;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

create database Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

use Capital_One_Bank
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE TABLE Users (
    UserID INT PRIMARY KEY IDENTITY,
    Username NVARCHAR(50) NOT NULL unique,
    Password NVARCHAR(50) NOT NULL unique,
    Role NVARCHAR(20) NOT NULL
);
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
INSERT INTO Users (Username, Password, Role)
VALUES 
('admin', '1234', 'مدير'),
('employee1', '5678', 'موظف');

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE CheckUserLogin
    @Username NVARCHAR(50),
    @Password NVARCHAR(50)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT Role
    FROM Users
    WHERE Username = @Username AND Password = @Password;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE AddUser
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    INSERT INTO Users (Username, Password, Role)
    VALUES (@Username, @Password, @Role);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DeleteUser
    @UserID INT
AS
BEGIN
    DELETE FROM Users
    WHERE UserID = @UserID;

END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmploye
AS
BEGIN
    select* from Users
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE UpdateUser
    @UserID INT,
    @Username NVARCHAR(50),
    @Password NVARCHAR(50),
    @Role NVARCHAR(20)
AS
BEGIN
    UPDATE Users
    SET Username = @Username,
        Password = @Password,
        Role = @Role
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE SearchUserByID
    @UserID INT
AS
BEGIN
    SET NOCOUNT ON;

    SELECT UserID, Username,Password, Role
    FROM Users
    WHERE UserID = @UserID;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Customers (
    Balance DECIMAL(18,2) NOT NULL DEFAULT 0,
    AccountNumber BIGINT identity(189564582,2),       -- رقم الحساب
    PhoneNumber NVARCHAR(20) unique not null,   -- رقم الهاتف
    FullName NVARCHAR(100),
    NationalID NVARCHAR(20),
    BirthDate DATE,
    Nationality NVARCHAR(50),
    Gender NVARCHAR(10),
    Age INT,
    Address NVARCHAR(200),

    CONSTRAINT PK_Customers PRIMARY KEY (AccountNumber, PhoneNumber) -- مفتاح أساسي مركب

);
--===========================================================================================================================
--===========================================================================================================================

-- حذف المفتاح الأساسي القديم
ALTER TABLE Customers
DROP CONSTRAINT PK_Customers;
--===========================================================================================================================
--===========================================================================================================================

-- تعيين رقم الهاتف كمفتاح أساسي
ALTER TABLE Customers
ADD CONSTRAINT PK_Customers PRIMARY KEY (PhoneNumber);

ALTER TABLE Customers
ADD AccountType NVARCHAR(20) NOT NULL DEFAULT 'جاري';



--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE AddCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    INSERT INTO Customers ( PhoneNumber, FullName, NationalID, BirthDate, Nationality, Gender, Age, Address, Balance, AccountType)
    VALUES ( @PhoneNumber, @FullName, @NationalID, @BirthDate, @Nationality, @Gender, @Age, @Address, @Balance, @AccountType);
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE UpdateCustomer
    @PhoneNumber NVARCHAR(20),
    @FullName NVARCHAR(100),
    @NationalID NVARCHAR(20),
    @BirthDate DATE,
    @Nationality NVARCHAR(50),
    @Gender NVARCHAR(10),
    @Age INT,
    @Address NVARCHAR(200),
    @Balance DECIMAL(18,2),
    @AccountType NVARCHAR(20) -- جاري أو توفير
AS
BEGIN
    UPDATE Customers
    SET FullName = @FullName,
        NationalID = @NationalID,
        BirthDate = @BirthDate,
        Nationality = @Nationality,
        Gender = @Gender,
        Age = @Age,
        Address = @Address,
        Balance = @Balance,
        AccountType = @AccountType
    WHERE  PhoneNumber = @PhoneNumber;
END



--===========================================================================================================================
--===========================================================================================================================



CREATE PROCEDURE DeleteCustomer
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    DELETE FROM Customers
    WHERE  PhoneNumber = @PhoneNumber;
END




--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SelectCustomer
AS
BEGIN
    select* from Customers
END



--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE SearchCustomer
    @AccountNumber BIGINT = NULL,
    @PhoneNumber NVARCHAR(20) = NULL
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountNumber,
           PhoneNumber,
           FullName,
           NationalID,
           BirthDate,
           Nationality,
           Gender,
           Age,
           Address,
           AccountType
    FROM Customers
    WHERE (@AccountNumber IS NULL OR AccountNumber = @AccountNumber)
      AND (@PhoneNumber IS NULL OR PhoneNumber = @PhoneNumber);
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE TABLE Transactions (
    TransactionID INT PRIMARY KEY IDENTITY(1,1),
    AccountNumber BIGINT NOT NULL,
    PhoneNumber NVARCHAR(20) NOT NULL,
    TransactionType NVARCHAR(20) NOT NULL, -- Deposit, Withdraw, Transfer
    Amount DECIMAL(18,2) NOT NULL,
    TransactionDate DATETIME DEFAULT GETDATE(),
    ReceiverAccount BIGINT NULL,
    ReceiverPhone NVARCHAR(20) NULL,
    Notes NVARCHAR(200) NULL,

    -- ربط مع جدول العملاء
    CONSTRAINT FK_Transactions_Customers FOREIGN KEY (PhoneNumber)
        REFERENCES Customers(PhoneNumber)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);




--===================================================================================================================================
--===========================================================================================================================
---================================================================================================================================

CREATE PROCEDURE selecttransaction
as
begin
    select* from Transactions
end




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--================================================================================================================================
CREATE PROCEDURE TransferAmount
    @SenderPhone NVARCHAR(20),
    @ReceiverPhone NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @SenderPhone AND Balance >= @Amount)
        BEGIN
            -- خصم من المرسل
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @SenderPhone;

            -- إضافة للمستلم
            UPDATE Customers
            SET Balance = Balance + @Amount
            WHERE PhoneNumber = @ReceiverPhone;

            -- تسجيل الحركة
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount, ReceiverAccount, ReceiverPhone)
            SELECT s.AccountNumber, s.PhoneNumber, 'Transfer', @Amount, r.AccountNumber, r.PhoneNumber
            FROM Customers s
            JOIN Customers r ON r.PhoneNumber = @ReceiverPhone
            WHERE s.PhoneNumber = @SenderPhone;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للتحويل', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END




--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE DepositAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;
    BEGIN TRY
        BEGIN TRANSACTION;

        IF NOT EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber)
        BEGIN
            RAISERROR('العميل غير موجود', 16, 1);
            ROLLBACK TRANSACTION;
            RETURN;
        END

        UPDATE Customers
        SET Balance = Balance + @Amount
        WHERE PhoneNumber = @PhoneNumber;

        INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
        SELECT AccountNumber, PhoneNumber, 'Deposit', @Amount
        FROM Customers
        WHERE PhoneNumber = @PhoneNumber;

        COMMIT TRANSACTION;
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END


--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
CREATE PROCEDURE WithdrawAmount
    @PhoneNumber NVARCHAR(20),
    @Amount DECIMAL(18,2)
AS
BEGIN
    SET NOCOUNT ON;

    BEGIN TRY
        BEGIN TRANSACTION;

        -- تحقق أن الرصيد يكفي
        IF EXISTS (SELECT 1 FROM Customers WHERE PhoneNumber = @PhoneNumber AND Balance >= @Amount)
        BEGIN
            -- خصم المبلغ من الرصيد
            UPDATE Customers
            SET Balance = Balance - @Amount
            WHERE PhoneNumber = @PhoneNumber;

            -- تسجيل الحركة في جدول Transactions
            INSERT INTO Transactions (AccountNumber, PhoneNumber, TransactionType, Amount)
            SELECT AccountNumber, PhoneNumber, 'Withdraw', @Amount
            FROM Customers
            WHERE PhoneNumber = @PhoneNumber;

            COMMIT TRANSACTION;
        END
        ELSE
        BEGIN
            RAISERROR('الرصيد غير كافٍ للسحب', 16, 1);
            ROLLBACK TRANSACTION;
        END
    END TRY
    BEGIN CATCH
        ROLLBACK TRANSACTION;
        THROW;
    END CATCH
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE GetAccountInfo
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SET NOCOUNT ON;

    SELECT AccountType, Balance
    FROM Customers
    WHERE PhoneNumber = @PhoneNumber;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectCustomers
AS
BEGIN
    SELECT * FROM Customers;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectEmployees
AS
BEGIN
    SELECT * FROM Users;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE SelectTransactions
AS
BEGIN
    SELECT * FROM Transactions;
END
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE GetWithdrawalsByPhone
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SELECT * FROM Transactions
    WHERE PhoneNumber = @PhoneNumber AND TransactionType = 'Withdraw'
END

--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================
--===========================================================================================================================


CREATE PROCEDURE GetDepositsByPhone
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SELECT * FROM Transactions
    WHERE PhoneNumber = @PhoneNumber AND TransactionType = 'Deposit'
END

--===========================================================================================================================
--===========================================================================================================================

CREATE PROCEDURE GetTransfersByPhone
    @PhoneNumber NVARCHAR(20)
AS
BEGIN
    SELECT * FROM Transactions
    WHERE PhoneNumber = @PhoneNumber AND TransactionType = 'Transfer'
END